import numpy as np

a = np.array(([1, 2, 3],
              (4, 5, 6),
              (7, 8, 9)))  # 在创建数组时，使用方括号和圆括号均可，np只会读取其中数据并创建np类型数组，但是取值时不能使用圆括号，只能使用方括号

aa = np.array((1, 2, 3, 4, 5, 6, 7, 8, 9))

b = a[2]
print("获取第3行数据：", b)

c = a[:, 1]
print("获取第2列数据：", c)

d = a[0, 1]
print("获取1行2列数据：", d)

e = a[:, 1:3]
print("获取2-3列数据：\n", e)

f = a[0:2]
print("获取1-2行数据：\n", f)

g = a[1:3, 1:3]  # 使用:进行连续选取时要注意第一个位置是0，0:3代表的是[0,3)位置上的数，可以看成和range一样左闭右开
print("获取2-3行，2-3列数据：\n", g)

h = a[::-1] # 使用两个冒号和-1进行翻转操作
print("行翻转的结果是；\n", h)

i = a[:, ::-1]
print("列翻转的结果是：\n", i)

j = a[::-1, ::-1]
print("行列翻转的结果是：\n", j)

k = a[1, ::-1]
print("翻转第2行：\n", k)

l = a[(a > 4) & (a < 8)]
print("取出大于4小于8的数组：\n", l)

m = aa[0:9:2]
print("以一定步长取数：\n", m)

n = aa[9:0:-2]
print("以一定步长逆序取数：\n", n)
